module.exports = function smile() {
    let arr =
        ['— Как бы вы описали свою жизнь в двух словах?\n' +
            '— За что?!', 'Ученые с помощью электронного микроскопа прочитали сноски в кредитном договоре.', '18–летняя девушка переспала с 50–летним мужиком. Рассказывает подругам:\n' +
            '\n' +
        '    — Блииин! Час прелюдия, час занимались любовью, потом всю ночь стихи читал… Больше ваще не буду с ровесниками встречаться!', 'Любимый ученик преподавателя геометрии был многогранен.', '«Дорогой Дед Мороз! Я просила у вас в прошлом году розовый «Бентли», но мое желание так и не исполнилось.\n' +
        '\n' +
        '    С уважением, Памела Андерсон».\n' +
        '\n' +
        '«Дорогая Памела Андерсон, скажите еще спасибо, что я не исполнил желание Рустама из Дагестана.\n' +
        '\n' +
        '    С уважением, Дед Мороз».', '— Девушка, что вы делаете сегодня вечером?\n' +
        '\n' +
        '— Я совершенно свободна. А что?\n' +
        '\n' +
        '— Я бы на вашем месте сходил в спортзал.', ' — Дорогой, купи мне телефон.\n' +
        '\n' +
        '— А как же тот другой, который у тебя есть?\n' +
        '\n' +
        '— Другой купит мне шубу.',
            'Чем дольше я занимаюсь боксом, тем больше для меня загадочного и непонятного.', ' Все еще жду, когда мне в жизни пригодятся дециметры.', '— Я же просила одну бутылку купить.\n' +
            '\n' +
            '— Одной не было.\n' +
        '\n', 'На чеченской свадьбе Рамзан Кадыров поймал автомат невесты.', '— Какую суперспособность ты бы хотела?\n' +
        '\n' +
        '— Платежеспособность.', '— А что вы вчера ели?\n' +
        '\n' +
        '— Голубя ел.\n' +
        '\n' +
        '— А вы голого голубя ели?\n' +
        '\n' +
        '— Да, поймал, ощипал и голого голубя ел.\n' +
        '\n' +
        '— А вы голову голубя ели?\n' +
        '\n' +
        '— Да, голову голубя ел.\n' +
        '\n' +
        '— А вы голую голову голубя ели?\n' +
        '\n' +
        '— Ну, голую голову голубя ел. А в чем, собственно, дело?\n' +
        '\n' +
        '— Хм-м-м… Честно говоря, я логопед, но чем смог — помог!', '«Работать» — это когда в конце рабочего дня на вашем смартфоне 95% зарядки…', ' Учитель информатики не пользуется антивирусом, он говорит: «Ощущения не те»!', ' У Вити в тюрьме была кличка Д-Артаньян, потому что он сидел один за всех.', 'Со словами: «Я выбираю жить в кайф,» работник завода порезал в Доширак сосисочку.', 'Новое лекарство: не бухай. Не бухай – помогает печени утром, днем и вечером.', ' На встречу одноклассников пришел только отличник Коля, все остальные троечники приехали, прилетели и приплыли.', 'После открытия дельфинария в Бутово уровень IQ на районе увеличился на 10%.', 'Бабка за внучку, Жучка за кошку и только дед в семье был адекватный и проголосовал за реально существующего кандидата.', 'У путан дела пошли в гору, когда они скинулись и отремонтировали свой участок дороги.', 'Сборная Андорры по синхронному плаванию проиграла пельменям. Те хотя бы всплыли.', 'Отец случайно проглотил флешку, так сказать, папка с файлами.', 'Гадалка по руке сказала фрезеровщику, что он плохой фрезеровщик.', 'Завтра в ДК “Железнодорожников” пройдет прощальный концерт группы Rammstein. Попрощаться с ДК “Железнодорожников” можно в 17:00.', 'Внук стал сомневаться, что котята сбежали, когда дед стал рисовать три новые звездочки на ведре.', 'В деревне Попыхи открылся новый бордель. Приезжайте к нам. Секс в Попыхах – что может быть лучше!', ' Девушка так хорошо танцевала стриптиз, что сначала все досмотрели ее выступление, а уже потом выгнали с саммита большой восьмерки', 'Мальчик так часто болел, что у него даже первый секс был над картошкой', ' Очень хитрый бомж мурлыкает, когда подслеповатая бабушка выносит покушать', 'Провинциальные новости. У деревенской путаны есть тетрадка с должниками', 'В семье анестезиолога жена через полгода поняла, что муж её бьёт.', 'После выпускного было жалко покидать школу, но ее было уже не потушить.', 'Похороны хипстера прошли с хештэгами “помним, любим, скорбим”', 'Аферист, выдававший себя за Путина, спалился на фразе «Однозначно».', 'В мытищинском клубе диджей так филигранно сводил треки, что местные не успевали подраться.', 'Сорок лет Моисей водил евреев по Икее, пока те не нашли отдел уцененных товаров.', 'Эвакуаторщик пришел в детский сад за сыном, а его уже КТО-ТО забрал.', 'На “Битве экстрасенсов” колдунья из Липецка прошла все этапы и ее сожгли как ведьму.', 'Богатый гопник заплевал весь двор фисташками.', 'У самой патриотичной американки тест на беременность показал 13 полосок и 50 звездочек.', 'Паша решил сделать Вике предложение и встал на колено. От боли Вика согласилась.', 'На утреннике девочка в костюме феи махала палочкой не потому, что хотела волшебства, а потому что хотела костюм дирижера, но тупые родители опять все сделали по-своему.', 'В Голливуде прошел день донора, вся собранная кровь пойдет на новый фильм Квентина Тарантино.', 'Парню на стройке упал кирпич на голову, и он пошел домой сломя голову.', 'Баскетболист-дибил нет-нет да встанет на ворота', 'У парня, который всегда слушался свою маму, первый секс был не в романтичной обстановке, а в подштанниках.', 'Владелец фермы иногда жалуется, что потратил на эту скотину лучшие годы своей жизни', 'Мало кто знает, но продавщицы пакетов живут вдесятером внутри одной огромной продавщицы пакетов', 'Танцовщица го-го решила получить второе образование, и стала танцовщицей го-го-го-го.', 'Если врач говорит, что у него плохие новости, то дождитесь конца, в конце обычно новости про львенка в омском зоопарке и погоду.', '«Хлеб всему голова,» – подумал Вася и приклеил батон к сломанной кукле.', 'Их губы были всё ближе и ближе, и он прошептал: «Ты всё равно годен. Ничего не выйдет».', 'Было у Гуфа 3 сына: старший, младший и, как младший, но на один помладше.', 'Чтобы превратить «Винни Пуха» в триллер, достаточно заменить опилки в его голове на голоса невинно убитых пчёл.', '– А я знаю, почему в конце апреля снег валит. Знаю я, откуда ноги растут! – Ты что, молчи! Нельзя со сцены произносить, откуда ноги растут.', '– Наташ, ходят слухи, что на тебя ведущий глаз положил. – Мне нужны домогательства. – Может, доказательства? – Я свой выбор сделала.', ' Пользуясь случаем, хочу передать привет моим одногруппникам. Но только тем, с кем у меня совпадает группа крови. Вот такие у нас общие интересы.', 'Автолюбитель Иннокентий ездит на велосипеде, но это не мешает ему быть автолюбителем и Иннокентием.', 'И такое бывает: маленький мальчик не выдержал напряжения и потерял сознание во время игры «Идет коза рогатая»', 'Несчастным случаем завершился фестиваль несчастных случаев.', 'Оренбургская поговорка. Муж в дверь, жена в Тверь, дочь в тверк.', 'Диспетчер вокзала один раз не повторила, и ничего не произошло.', 'Девушка с очень большой грудью различает до 30 кавказских свистов.', 'На свадьбе гопников кричат «не горько», а «сосамба».', 'Со своим мужем учительница русского языка 30 лет живет вместе, а по выходным — слитно.', 'Пешеход, провалившийся в люк, не спешил звать на помощь, ведь не каждый день удается сделать селфи со сплинтером.', 'У парня был настолько неудачный день, что даже wi-fi роутер показывал две полоски.', 'В клубе был настолько плохой фейсконтроль, что по клубу бегали стаи собак.', 'У парня был такой кривой позвоночник, что при ходьбе все думали, что он парадирует змею.', ' Работники «Орифлейм» не боятся конфликтов с кавказцами, ведь они могут позвать трех друзей, а те еще трех и еще…', 'Радости профессии: водителю эвакуаторщика не надо думать, как разыграть друга на 1 апреля.', 'Когда работнице паспортного стола становится скучно, она делает себя многодетной матерью и придумывает смешные имена детям.', 'Василий думал, что у чайного пакетика, как и у кошки, 9 жизней, но, как выяснилось, кошку можно заваривать только один раз.', 'Отец 12 детей теперь и флешки извлекает безопасно.']

    let random = Math.floor(0 + Math.random() * (arr.length + 1 - 0));
    return console.log(arr[random]);
}
